Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །གྲོང་མཆོག་རྒྱལ་པོའི་ཁབ་ཏུ་ནི།
en: In the most excellent city of Rājagṛha,

source: །བདག་ནི་ཚོང་དཔོན་ཁྱེའུ་གྱུར་ནས།
en: I was a son of the head of a guild. “When I came home for a meal

source: །ཁྱིམ་གྱི་ཕྱི་རོལ་རྩེ་རྩེ་ནས། །ཟན་གྱི་ཕྱིར་ཡང་ཞུགས་པ་ལས།
en: After playing outside the house,

source: །དེ་ན་ཕ་མ་གཉིས་ཀ་ནི།
en: I saw my parents there

source: །དབེན་པར་འདུག་པ་བདག་གིས་མཐོང་།
en: Hiding in a hidden place.

source: །དེ་གཉིས་མཐོང་བས་བདག་བརྡེགས་ཤིང་།
en: “Having been seen, they hit me

source: །སྐྱེངས་པས་ཀྱང་ནི་སྤྱོ་བ་བྱས།
en: And scolded me out of shame.

source: །ཕ་དང་མ་ནི་གཉིས་ཀ་ལ། །ཡིད་ཀྱིས་ཉེས་པ་བྱས་པ་ནི།
en: I committed a sin of the mind Against my two parents, thinking,

source: །གང་ཚེ་ཆེན་པོར་གྱུར་པ་ན།
en: ‘When I grow bigger,

source: །འདམ་བུ་བཅོམ་པ་བཞིན་བསད་སྙམ།
en: I will kill them as if cutting reeds!’

source: །བདག་གི་ཡིད་ཀྱིས་ཉེས་བྱས་ཀྱི། །ལུས་ཀྱིས་བྱས་པ་མ་ཡིན་ནའང་།
en: “Although it was my mind, Not my body, that committed the sin,

source: །བདག་ནི་དམྱལ་བ་ཐིག་ནག་ཏུ། །སྡུག་བསྔལ་མི་བཟད་ཉམས་སུ་མྱོང་།
en: I experienced unbearable pain In the Black Cord Hell.

source: །དེ་ཡི་ལས་ཀྱི་ལྷག་མ་ཡིས།
en: “Because of the remains of that karma,

source: །བདག་གི་སྲིད་པ་ཐ་མ་འདིར།
en: In this final existence of mine

source: །མུ་སྟེགས་གཞན་གྱི་དགེ་སྦྱོང་གིས།
en: Śramaṇas belonging to a different faith

source: །འདམ་བུ་བཅོམ་བཞིན་བདག་གཏོག་འགྱུར།
en: Will kill me as if cutting a reed.

source: །བདག་ནི་སྡུག་བསྔལ་དེ་ཉིད་ཀྱིས། །ཤི་བར་འགྱུར་ཏེ་དེ་ནས་ནི།
en: “I will die from that very pain. After that,

source: །ལས་རྣམས་ཀྱི་ནི་ལྷག་མ་ཡང་།
en: The remainder of my actions

source: །ཐ་མ་ཟད་པར་འགྱུར་བ་ཡིན། །དེ་བས་ཕ་དང་མ་དག་ལ།
en: Will come to an end. “Therefore, you should make your mind Pure toward your parents.

source: །སེམས་ནི་རབ་ཏུ་དད་པར་བྱ། །སེམས་དད་པ་ཡི་རྒྱུ་ཡིས་ནི།
en: By means of a pure mind,

source: །སེམས་ཅན་འགྲོ་བ་བཟང་པོར་འགྲོ།
en: Beings go to superior modes of existence.”

source: །དེ་ལྟར་གནས་བརྟན་པང་ནས་སྐྱེས།
en: Thus the Elder Kolita Explained his karma,

source: །པང་ནས་སྐྱེས་ཀྱི་ལེའུ་སྟེ་གསུམ་པའོ།། །།
en: Here ends the third section: The Section of Kolita. 4. Śobhita

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཛེས་ལྡན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Śobhita, “O Venerable Śobhita, the venerable Kolita has explained his karmic bond.

source: །ཚེ་དང་ལྡན་པ་མཛེས་ལྡན་ཚེ་དང་ལྡན་པ་པང་ནས་སྐྱེས་ཀྱིས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Now you, Venerable Śobhita, should explain your karmic bond.”

source: ད་ནི་ཚེ་དང་ལྡན་པ་མཛེས་ལྡན་གྱིས་ཀྱང་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་མཛེས་ལྡན་གྱིས་དགེ་སློང་གི་དགེ་འདུན་གྱི་མདུན་དུ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་པ།
en: Then the venerable Śobhita did explain his karmic bond in the presence of the community of monks:

source: དགེ་འདུན་ཀུན་དགར་བདག་སོན་ན།
en: “When I went to the community’s park,

source: །ཁྱམས་དེའི་ཕྱག་དར་མཐོང་ནས་ནི།
en: Having seen a heap of dust in the garden,

source: །བདག་གིས་ཕྱགས་མ་བླངས་ནས་སུ།
en: I took a broom

source: །དེ་ཚེ་དགའ་བས་ཕྱག་དར་བྱས།
en: And then, with pleasure, cleaned the place.

source: །དེ་ནས་བདག་གིས་སེམས་དད་པས།
en: “Thereupon with my mind filled with faith,

source: །ཁྱམས་དེ་གཙང་མར་མཐོང་ནས་ནི།
en: Seeing the garden cleaned, I said,

source: །ཇི་ལྟར་ཁྱམས་དེ་གཙང་བ་ལྟར།
en: ‘Just as this garden is clean,

source: །ཉོན་མོངས་མེད་པར་གྱུར་ཅིག་སྨྲས།
en: May my defilements vanish!’

source: །དགེ་བའི་རྩ་བ་དེ་ཡིས་ནི།
en: “By that root of merit,

source: །གང་དང་གང་དུ་སྐྱེས་པར་ཡང་།
en: Wherever I was reborn

source: །བདག་གི་གཟུགས་ནི་བཟང་བ་དང་། །བལྟ་ན་སྡུག་ཅིང་མཛེས་པར་གྱུར།
en: I was well proportioned, Pleasant to behold, and attractive.

source: །དེ་ཡི་ལས་ཀྱི་ལྷག་མས་ནི།
en: “Because of the remains of that karma,

source: །བདག་གི་ལུས་ནི་ཐ་མ་ལ། །བདག་གི་ཕ་དང་མ་གཉིས་ཀྱིས།
en: In my final body,

source: །བདག་མིང་མཛེས་ལྡན་ཁོ་ནར་བཏགས།
en: I was named Śobhita, ‘Beautiful One,’ By my two parents.

source: །མཛེས་ལྡན་བདག་ནི་བཙས་གྱུར་ཏེ།
en: “I was born beautiful.

source: །གང་ཚེ་གཉེན་ཚོགས་མདུན་ཕྱིན་པ། །དེ་ཚེ་གཉེན་ནི་ཐམས་ཅད་ཀྱིས།
en: Whenever I was in my relatives’ presence,

source: །མགུ་ཞིང་ཡིད་དགའ་བཀུར་སྟི་བྱས།
en: I was liked, loved, and worshiped By all the relatives. “I have pleased this caravan leader,

source: །རྫོགས་སངས་བླ་ན་མེད་པ་ཡི། །དེད་དཔོན་འདི་ནི་མཉེས་པར་བྱས།
en: The Supremely, Completely Awakened One.

source: །མྱ་ངན་འདས་པ་བསིལ་གྱུར་པའི། །དགྲ་བཅོམ་པ་ཡང་བདག་གིས་ཐོབ།
en: I attained nirvāṇa, The peaceful state of an arhat.

source: །བདག་གི་ཉོན་མོངས་མེད་གྱུར་ཅེས། །སྨོན་ལམ་བཏབ་པ་གང་ཡིན་པ།
en: “The aspiration I made—‘May my defilements vanish!’—

source: །བྱ་བ་བྱས་ཏེ་ཉོན་མོངས་མེད།
en: Was fulfilled. What is to be done has been done, and there are no more defilements.

source: །དགྲ་བཅོམ་ཟག་པ་མེད་པ་ཡིན།
en: I am an untainted arhat. “Superior to one who cleans

source: །འཛམ་བུའི་གླིང་ནི་ཐམས་ཅད་ཀྱང་། །ཀ་ཤིའི་གོས་ཀྱིས་ཕྱགས་པ་བས།
en: The entire continent of Jambu with cloth from Kāśi

source: །གང་གིས་འདོད་ཆགས་བྲལ་བ་ཡི།
en: Is one who, free from desire,

source: །དྲང་སྲོང་འཆག་ས་གཅིག་ཕྱགས་པའོ།
en: Cleans the path for a ṛṣi’s walking.

source: །འཛམ་བུའི་གླིང་ན་དྲང་སྲོང་གི། །འཆག་ས་ཐམས་ཅད་ཕྱགས་པ་བས།
en: “Superior to one who cleans The walking paths of ṛṣis’ all over the continent of Jambu Is one who cleans land as small as a mat

source: །གང་གིས་ཕྱོགས་བཞིའི་དགེ་འདུན་གྱི།
en: Belonging to the community of the four directions.

source: །རེ་ལྡེ་ཙམ་དག་ཕྱགས་པའོ།
en: “Superior to one who cleans

source: །འཛམ་བུའི་གླིང་ན་དགེ་འདུན་གྱི། །ཀུན་དགའ་ར་བ་ཀུན་ཕྱགས་པས།
en: The parks of the community all over the continent of Jambu

source: །གང་གིས་རྒྱལ་བའི་མཆོད་རྟེན་ནི།
en: Is one who cleans a part of the stūpa of the Victor

source: །ཁྲུ་གང་ཙམ་ཞིག་ཕྱགས་པའོ།
en: That is as small as the palm of a hand.

source: །བདག་ཉིད་ཀྱིས་ནི་གང་རྟོགས་པའི།
en: “Having realized these differences

source: །ཁྱད་པར་དེ་དག་ཤེས་བྱས་ནས།
en: That I have realized,

source: །བདེར་གཤེགས་མཆོད་རྟེན་ཕྱགས་ནས་ནི།
en: You should clean the Sugata’s stūpa

source: །སེམས་ཀྱང་རབ་ཏུ་དང་བར་གྱིས། །དེ་ལྟས་རྫོགས་པའི་སངས་རྒྱས་ཀྱི། །ཡོན་ཏན་མང་པོ་ཤེས་པ་ཡིས།
en: And make your minds filled with faith. “After that, those who know the many good qualities Of the Completely Awakened One

source: །མཆོད་རྟེན་རྣམས་ལ་བཀུར་སྟི་བྱོས།
en: Should venerate the stūpas.

source: །འབྲས་བུ་ཆེན་པོ་དག་ཏུ་འགྱུར།
en: They will gain great fruits.

source: །བཙུན་པ་བདག་གིས་དགེ་བ་ནི།
en: “O honored ones, this is the good deed

source: །གང་བྱས་དྲན་པ་འདི་ལགས་ཏེ།
en: That I remember performing.

source: །དེ་ཡི་འབྲས་བུ་སྡུག་པ་དང་། །འདོད་པ་ཡིད་འོང་ཉམས་སུ་མྱོང་།
en: I have experienced its desirable, Lovable, pleasant fruit. “Therefore, one should perform excellent veneration

source: །དེ་བས་རྒྱལ་བའི་མཆོད་རྟེན་ལ། །མཆོད་པ་དག་ནི་བཟང་པོ་གྱིས།
en: Of the stūpa of the Victor.

source: །བཙུན་པ་འདི་ནི་བསོད་ནམས་ཞིང་།
en: O honored ones, this is The best, the supreme field of merit.

source: །དམ་པ་བླ་ན་མེད་པ་ཡིན།
en: “The offerings by those whose minds are filled with faith

source: །རྫོགས་སངས་དེ་བཞིན་གཤེགས་པའམ།
en: In the Completely Awakened One, the Tathāgata,

source: །སངས་རྒྱས་རྣམས་ཀྱི་ཉན་ཐོས་ལ། །སེམས་ནི་རབ་ཏུ་དང་བྱས་པའི།
en: Or the disciples of the buddhas

source: །ཡོན་ནི་ཆུང་ངུར་འགྱུར་མ་ཡིན།
en: Will not be small.”

source: །དེ་ལྟར་གནས་བརྟན་མཛེས་ལྡན་གྱིས།
en: Thus the Elder Śobhita Explained his karma,

source: །མཛེས་ལྡན་གྱི་ལེའུ་སྟེ་བཞི་པའོ།། །།
en: Here ends the fourth section: The Section of Śobhita. 5. Sumanas

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་སྣ་མའི་མེ་ཏོག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་སྣ་མའི་མེ་ཏོག་ཚེ་དང་ལྡན་པ་མཛེས་ལྡན་གྱིས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Sumanas, “O Venerable Sumanas, the venerable Śobhita has explained his karmic bond.

source: ད་ནི་ཚེ་དང་ལྡན་པས་ཀྱང་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །སྣ་མའི་མེ་ཏོག་རྣ་རྒྱན་བྱས།
en: Now you, Venerable Sumanas, should explain your karmic bond.” He said: “Wearing a nutmeg (sumanas) flower as an earring,

source: །མགོ་ལ་མེ་ཏོག་ཕྲེང་བཅིངས་ནས། །ནེའུ་ཟླ་རྣམས་ཀྱིས་ཡོངས་བསྐོར་ཏེ།
en: With a garland of flowers bound around my head,

source: །སྐྱེད་མོས་ཚལ་གྱི་གནས་སུ་བྱུང་།
en: I went to a park,

source: །དེ་ན་ཐུབ་པ་ཆེན་པོ་པ།
en: Surrounded by friends.

source: །རྣམ་པར་གཟིགས་ཀྱི་མཆོད་རྟེན་ལ།
en: “I saw many people there,

source: །སྐྱེ་བོའི་ཚོགས་ཆེན་ཐམས་ཅད་ནས།
en: From every direction,

source: །ལེགས་པར་མཆོད་པ་བདག་གིས་མཐོང་།
en: Respectfully venerating the stūpa Of the great Muni Vipaśyin. “Then I instructed my friends

source: །དེ་ནས་ནེའུ་ཟླ་རྣམས་ཁྲིད་ནས།
en: To set on the stūpa

source: །རང་རང་གི་ནི་ཕྲེང་བ་ཀུན།
en: Every one of their garlands,

source: །སེམས་ནི་དད་པར་བྱས་ནས་སུ། །མཆོད་རྟེན་དེ་ལ་གདགས་པ་བྱས།
en: With their minds made pure.

source: །དེ་ན་བདག་གིས་དེ་དག་དང་། །སྐྱེ་བོ་མང་པོ་གཞན་མཐོང་ནས།
en: “Having seen them do so there, Along with many others,

source: །སྣ་མ་རྣ་བ་ལས་བཀྲོལ་ཏེ།
en: I removed the nutmeg flower from my ear

source: །དེ་ཚེ་མཆོད་རྟེན་གདགས་པ་བྱས།
en: And then set it on the stūpa.

source: །དགེ་བའི་རྩ་བ་དེས་ན་བདག །གང་དང་གང་དུ་སྐྱེས་པར་ཡང་།
en: “By this root of merit, Wherever I was reborn,

source: །བསོད་ནམས་བྱས་པ་མཛེས་པ་ཡི།
en: Having made such merit,

source: །མེ་ཏོག་གཅིག་ནི་བཏང་བས་ན།
en: “Since I had offered one flower, I enjoyed divine lives

source: །ལོ་ནི་བྱེ་བ་བརྒྱ་ཕྲག་ཏུ། །བདག་གིས་ལྷ་ཡི་ཡོངས་སྤྱད་ནས།
en: For a thousand years

source: །དེ་ཡི་ལྷག་མས་མྱ་ངན་འདས།
en: And was emancipated through the remains of that karma.

source: །བཙུན་པ་གལ་ཏེ་སངས་རྒྱས་ཀྱི།
en: “O honored ones, if one knows

source: །ཡོན་ཏན་ཕལ་ཆེར་འཚལ་གྱུར་ན།
en: The many good qualities of the Buddha, One will perform veneration again and again

source: །སེམས་ནི་ཤིན་ཏུ་དད་པ་ཡིས། །ཕྱིར་ཞིང་བསྙེན་བཀུར་བགྱིས་པ་ཞིག །དེ་ལྟས་རྫོགས་པའི་སངས་རྒྱས་ཀྱི།
en: With perfectly pure thoughts.

source: །ཡོན་ཏན་མང་པོ་ཤེས་པ་ཡིས།
en: “Thus, those who know the many good qualities Of the Completely Awakened One

source: །མཆོད་རྟེན་རྣམས་ལ་བཀུར་སྟི་བྱོས། །འབྲས་བུ་ཆེན་པོ་དག་ཏུ་འགྱུར།
en: Should serve stūpas. They will gain great fruits. “The result of the offerings by those whose minds are filled with faith

source: །ཡོན་ནི་ཆུང་བར་འགྱུར་མ་ཡིན།
en: Will not be insignificant.

source: །ལས་ཀྱི་རྣམ་པར་སྨིན་པ་དེས།
en: “Because of the maturation of that karma,

source: །ཡང་སྲིད་སྐྱེ་བ་ཟད་པ་དང་། །ཉོན་མོངས་བཅོམ་ནས་བསིལ་གྱུར་པའི།
en: Having exhausted my rebirths, Destroyed defilements, and become peaceful,

source: །བདག་ནི་དགྲ་བཅོམ་མྱ་ངན་འདས།
en: I am an arhat, emancipated. “In the ‘beds of rebirth’ in transmigration

source: །བདག་ནི་ཡང་སྲིད་ཉལ་བ་དང་། །འཁོར་བ་གང་དུའང་ཉལ་མ་ཡིན།
en: I will never lie again.

source: །འདི་ཡིན་ལེན་པ་མེད་པར་འགྱུར།
en: I will never experience another.

source: །དེ་ཉིད་ཀྱི་ནི་རྒྱུ་ཡིས་བདག །སྣ་མའི་མེ་ཏོག་མིང་འདི་བཏགས།
en: “For this reason I was given this name, Sumanas.

source: །སྡུག་བསྔལ་ཀུན་ལས་བདག་གྲོལ་ཞིང་།
en: I was liberated from all suffering

source: །སྲིད་པའི་མཚོ་ལས་རྒལ་བར་གྱུར།
en: And crossed the ocean of existence.”

source: །དེ་ལྟར་གནས་བརྟན་སྣ་མ་ནི།
en: Thus the Elder Sumanas Explained his karma,

source: །སྣ་མའི་མེ་ཏོག་གི་ལེའུ་སྟེ་ལྔ་པའོ།། །།
en: Here ends the fifth section: The Section of Sumanas. 6. Koṭīviṃśa

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་བྱེ་བ་ཉི་ཤུ་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Koṭīviṃśa, “O Venerable Koṭīviṃśa, the venerable Sumanas has explained his karmic bond.

source: །ཚེ་དང་ལྡན་པ་བྱེ་བ་ཉི་ཤུ་པ་ཚེ་དང་ལྡན་པ་སྣ་མའི་མེ་ཏོག་གིས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Now you, Venerable One, should also explain your karmic bond.

source: །ཚེ་དང་ལྡན་པས་ཀྱང་ད་ནི་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །ཚེ་དང་ལྡན་པ་བྱེ་བ་ཉི་ཤུ་པས་ཅི་ཞིག་བྱས་ན་ལས་དེས་བཅོམ་ལྡན་འདས་ཀྱིས་བརྩོན་འགྲུས་རྩོམ་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན། དེས་སྨྲས་པ། རྣམ་པར་གཟིགས་ཀྱི་གསུང་རབ་ལ།
en: What karma did you, Venerable Koṭīviṃśa, create that caused you to be praised by the Blessed One as the best of those who exert themselves?” He said:

source: །རྒྱལ་པོའི་ཕོ་བྲང་བཤེས་ལྡན་དུ།
en: “In the royal capital Bandhumatī, In the time of Vipaśyin’s teachings, I built a dwelling place

source: །བདག་གིས་ཕྱོགས་བཞིའི་དགེ་འདུན་གྱི། །གནས་ཁང་གཅིག་ཅིག་བརྩིགས་ནས་ནི།
en: For the community of the four directions.

source: །བདག་གིས་གནས་ཁང་དེ་ཡི་གཞིར། །རས་ཕྲན་རྣམས་ཀྱིས་ས་གཞི་གཡོགས།
en: “I covered the floor Of the dwelling place with cloths.

source: །སེམས་དགའ་བ་དང་ཡིད་བདེ་བས།
en: Pleased and satisfied,

source: །དེ་ཚེ་སྨོན་ལམ་བཏབ་པ་ནི།
en: I then made an aspiration:

source: །རྫོགས་སངས་རྒྱས་ནི་མཉེས་བྱས་ཏེ།
en: “ ‘May I, after having pleased the Completely Awakened One

source: །བསྙེན་པར་རྫོགས་པ་ཐོབ་ནས་ནི།
en: And having succeeded in being ordained,

source: །མྱ་ངན་འདས་པ་མཆོག་ཞི་བ། །རྒ་མེད་གོ་འཕང་རེག་པར་ཤོག །བདག་གི་བསོད་ནམས་དེས་ནི་བདག །བསོད་ནམས་བྱས་པས་མཛེས་པ་ཡི།
en: Attain nirvāṇa, the supreme tranquility, The ageless state.’ “By this merit, Having made such merit,

source: །བསྐལ་པ་དགུ་བཅུར་ལྷ་དང་ནི།
en: For ninety eons

source: །མི་རྣམས་སུ་ནི་འཁོར་བར་གྱུར།
en: I transmigrated among the gods and humans.

source: །དེ་ནས་ལས་ཀྱི་ལྷག་མས་ནི།
en: “After that, because of the remains of that karma,

source: །བདག་གི་ལུས་ནི་ཐ་མ་ལ།
en: I was born in my final body In Campā, as the sole son

source: །ཙམ་པར་ཚོང་དཔོན་མཆོག་གི་ཡང་།
en: Of the best of the heads of the guilds.

source: །བུ་གཅིག་པར་ནི་བདག་སྐྱེས་སོ། །བདག་ནི་བཙས་མ་ཐག་ཏུ་ཡང་།
en: “As soon as I was born,

source: །ཕ་ཡིས་ཐོས་ནས་འདུན་གྱུར་པ།
en: My father was pleased to hear it and said,

source: །གཞོན་ནུ་ལ་ནི་བདག་གིས་ནོར།
en: ‘I will give my property,

source: །བྱེ་བ་ཉི་ཤུ་སྦྱིན་པར་བྱ།
en: Which is worth two hundred million (koṭī­dravyasya viṃśatiṃ), to my son!’

source: །བདག་གི་རྐང་མཐིལ་གཉི་གའི་སྤུ།
en: “The hair on the soles of my feet

source: །ཤིན་ཏུ་ཕྲ་ཞིང་མཉེན་པ་དང་། །རེག་ན་བདེ་ཞིང་འཇམ་པ་ཡི།
en: Was very fine, smooth, Pleasant to touch, and soft as wool,

source: །ཤིང་བལ་འདབ་ལྟའི་སོར་བཞི་སྐྱེས།
en: And it grew as long as the breadth of four fingers.

source: །འདས་པའི་བསྐལ་པ་དགུ་བཅུ་དང་། །བསྐལ་པ་གཅིག་འདི་ལྷག་པར་ནི། །ས་གཞི་གདིང་བས་མ་གཡོགས་པར། །རྐང་པ་འཇོག་ནི་མ་མྱོང་ངོ་།
en: “During the past ninety eons And this eon, I did not experience putting my feet on the ground Without a carpet covering it. “I have pleased this caravan leader,

source: །ཐམས་ཅད་གཟིགས་པས་བརྩོན་འགྲུས་ཅན།
en: “The All-Seeing One has praised me

source: །ཟག་མེད་ཉེས་པ་སྤངས་པ་ཡི།
en: Being untainted and free from faults,

source: །གོ་འཕང་མི་གཡོ་བདག་གིས་ཐོབ།
en: I attained the immovable state.” Thus the Elder Koṭīviṃśa

source: །གནས་བརྟན་བྱེ་བ་ཉི་ཤུ་པ།
en: Explained his karma,

source: །དེ་ལྟར་མ་དྲོས་མཚོ་ཆེན་དུ། །རང་གི་ལས་ནི་ལུང་བསྟན་ཏོ།
en: On the great lake Anavatapta.

source: །བྱེ་བ་ཉི་ཤུ་པའི་ལེའུ་སྟེ་དྲུག་པའོ།། །།
en: Here ends the sixth section: The Section of Koṭīviṃśa. 7. Vāgīśa

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་ངག་དབང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ངག་དབང་ཚེ་དང་ལྡན་པ་བྱེ་བ་ཉི་ཤུ་པས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Vāgīśa, “O Venerable Vāgīśa, the venerable Koṭīviṃśa has explained his karmic bond.

source: ཚེ་དང་ལྡན་པས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེས་སྨྲས་པ།
en: Now you, Venerable One, should also explain your karmic bond.” He said:

source: འདས་པའི་བསྐལ་པ་དགུ་བཅུར་ནི།
en: “During the past ninety eons,

source: །ལྷ་རྣམས་དང་ནི་མིར་སྐྱེས་ཏེ། །བདག་གིས་ངན་འགྲོ་མི་ཤེས་སོ། །བདག་གིས་དགེ་བ་མི་ཤེས་ཏེ། །ཕན་ཚུན་ཟླ་བ་ལྟས་འབའ་ཞིག་གིས། །རྣམ་པར་གཟིགས་ཀྱི་མཆོད་རྟེན་ནི།
en: I was born among beautiful gods and humans And never knew inferior modes of existence. “I performed veneration When I saw Vipaśyin’s stūpa, Not knowing it was good,

source: །མཐོང་ནས་དེ་ཚེ་བསྙེན་བཀུར་བྱས།
en: But only because I saw it. “I bought incense, a garland of flowers, and perfume

source: །འགྲོན་བུ་དྲུག་བཅུ་རྣམས་ཀྱིས་ནི། །དྲི་དང་ཕྲེང་བ་བྱུག་ཉོས་ཏེ།
en: With sixty kaparda

source: །མཆོད་རྟེན་ལ་ནི་གདགས་བྱས་པས།
en: And put them on the stūpa.

source: །བདག་ནི་ལོག་པར་ལྟུང་མ་གྱུར།
en: Because of this, I never descended into inferior states of existence.

source: །མྱ་ངན་འདས་པ་བསིལ་གྱུར་པའི། །དགྲ་བཅོམ་པ་ཡང་བདག་གིས་ཐོབ། །གལ་ཏེ་རྫོགས་སངས་ཤེས་གྱུར་ལ།
en: I attained nirvāṇa, The peaceful state of an arhat.

source: །མཆོད་རྟེན་དེ་ལ་བདག་གིས་སུ། །བཀུར་སྟི་བྱས་པར་གྱུར་ན་ནི།
en: “If I had served the stūpa In the knowledge of

source: །ལེགས་པ་མང་བྱེད་འགྱུར་བ་ཞིག །དེ་ལྟས་རྫོགས་པའི་སངས་རྒྱས་ཀྱི།
en: The Completely Awakened One, I would have done even more good.

source: །མཆོད་རྟེན་བཀུར་སྟི་བྱོས་ཤིག་དང་། །འབྲས་བུ་ཆེན་པོ་དག་ཏུ་འགྱུར།
en: Should serve stūpas. They will gain great fruits. “The All-Seeing One has praised me

source: །ཐམས་ཅད་གཟིགས་པས་མང་ཐོས་དང་། །སྣ་ཚོགས་གཏམ་དང་དགེ་བ་ཡི།
en: As the best of those who have heard much, The best narrator (vāgīśa),

source: །སྤོབས་ལྡན་ཚིགས་བཅད་བྱེད་པ་ནི། །རྣམས་ཀྱི་མཆོག་ཏུ་བདག་བསྟན་ཏོ།
en: The verse-composer endowed with excellent eloquence.”

source: །དེ་ལྟར་གནས་བརྟན་ངག་དབང་ནི།
en: Thus the Elder Vāgīśa Explained his karma,

source: །ངག་དབང་གི་ལེའུ་སྟེ་བདུན་པའོ།། །།
en: Here ends the seventh section: The Section of Vāgīśa. 8. Piṇḍola

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་བྷ་ར་དྭ་ཛ་བསོད་སྙོམས་ལེན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་བྷ་ར་དྭ་ཛ་བསོད་སྙོམས་ལེན་ཚེ་དང་ལྡན་པ་ངག་དབང་གིས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Piṇḍola­bharadvāja, “O Venerable Piṇḍola­bharadvāja, the venerable Vāgīśa has explained his karmic bond.

source: ཚེ་དང་ལྡན་པས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་བྷ་ར་དྭ་ཛ་བསོད་སྙོམས་ལེན་གྱིས་སྨྲས་པ།
en: Now you, Venerable One, should also explain your karmic bond.” Then the venerable Piṇḍola­bharadvāja said:

source: བདག་ནི་ཚོང་དཔོན་བུར་གྱུར་ནས།
en: “When, as a son of the head of a guild,

source: །ཕ་ཡི་ཁྱིམ་ན་དབང་བྱེད་ཚེ།
en: I was managing my father’s house,

source: །བདག་གིས་ཕ་ནི་ཡིད་བསྲུངས་ཤིང་།
en: I obeyed my father’s wishes

source: །མ་ལ་ལོག་པ་མི་མཐུན་བྱས།
en: But behaved falsely toward my mother.

source: །ཕ་དང་སྲིང་མོ་སྤུན་དང་ནི།
en: “Although I satisfied my father, sisters, brothers,

source: །བྲན་དང་ལས་བྱེད་རྣམས་ལ་ཡང་།
en: Slaves, and workmen

source: །ཟས་དང་སྐོམ་གྱིས་ཚིམ་བྱས་ཀྱང་།
en: With food and drink,

source: །མ་ལ་སྤྱོ་བ་བྱས་ནས་སུ།
en: I abused my mother.

source: །བདག་ནི་སེར་སྣས་ཟིལ་ནོན་པས།
en: “Ruled by avarice,

source: །མ་ལ་ཟས་ནི་མ་བྱིན་པར།
en: I did not give food to my mother

source: །ཁྲོས་པས་ཚིག་ཏུ་སྨྲས་པ་ནི།
en: But uttered these words with anger:

source: །ཟས་སུ་རྡོ་བ་ཟོ་ཤིག་བྱས།
en: ‘Eat stones for food!’

source: །ལས་ཀྱི་རྣམ་པར་སྨིན་པ་དེས། །རབ་ཏུ་ཚ་དང་ཐིག་ནག་གི།
en: “Because of the maturation of that karma,

source: །དམྱལ་བར་ལན་མང་ལྷུང་ནས་ནི།
en: I descended many times into the hells Called Intense Heat and Black Cord

source: །སྡུག་བསྔལ་མི་ཉུང་ཐོབ་པར་གྱུར།
en: And suffered great pain.

source: །དམྱལ་བ་དེ་ནས་ཤི་འཕོས་ནས།
en: “When I died in hell

source: །མི་ཡི་སྲིད་པ་ཐོབ་པ་ན།
en: And attained human life,

source: །བདག་ནི་རྡོ་བ་ཟ་བར་གྱུར།
en: I had to eat stones.

source: །བདག་གིས་རྡོ་བ་མང་ཟོས་ཤིང་།
en: I had to eat many stones And died,

source: །དེ་བཞིན་བཀྲེས་སྐོམ་སྡུག་བསྔལ་གྱིས། །བདག་ནི་འཆི་བའི་དུས་བྱས་སོ།
en: Suffering from hunger and thirst.

source: །མི་སྲིད་ཐོབ་པ་འདི་ཡིན་ཏེ།
en: This human life I have attained. I have pleased this caravan leader,

source: །ཤཱཀྱ་སེང་གེའི་བསྟན་པ་ལ། །བདག་གིས་རབ་བྱུང་ཐོབ་ནས་ནི།
en: In the teachings of the Lion of the Śākyans,

source: །ཐམས་ཅད་གཟིགས་པས་སེང་གེ་ཡི།
en: “The All-Seeing One has praised me

source: །སྒྲ་སྒྲོགས་པ་ཡི་མཆོག་ཏུ་བསྟན།
en: As the best of those who roar a lion’s roar.

source: །བདག་གིས་ཉོན་མོངས་ཐམས་ཅད་སྤངས།
en: I have abandoned all defilements;

source: །ཉོན་མོངས་བྲལ་བས་ཟག་པ་མེད།
en: I am untainted, for I am free from defilements.

source: །ད་དུང་དུ་ཡང་བཙུན་པ་དག །དེ་ལྟར་རྫུ་འཕྲུལ་ཐོབ་གྱུར་ཀྱང་།
en: “Still, O honored ones, Even though I have attained such magical power,

source: །ཕུག་ན་བདག་གི་ཟས་མཆིས་པ།
en: Dwelling in a cave, my food

source: །རྡོ་བ་ཉིད་དུ་གྱུར་ལགས་སོ།
en: Will be nothing but stones. “O honored ones, this is

source: །བཙུན་པ་བདག་གིས་སྡིག་པ་ནི། །གང་བགྱིས་དྲན་པ་འདི་ལགས་ཏེ། །ལས་རྣམས་ཆུད་མི་ཟ་བས་ན།
en: The sin I remember committing.

source: །དེ་ཡི་འབྲས་བུ་ཉམས་སུ་མྱོང་།
en: Its fruit is experienced, For actions never vanish.” Thus the Elder Piṇḍola­bharadvāja

source: །བྷ་ར་དྭ་ཛ་བསོད་སྙོམས་ལེན།
en: Explained his karma,

source: །བྷ་ར་དྭ་ཛ་བསོད་སྙོམས་ལེན་གྱི་ལེའུ་སྟེ་བརྒྱད་པའོ།། །།
en: Here ends the eighth section: The Section of Piṇḍola­bharadvāja. 9. Svāgata

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་ལེགས་འོངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Svāgata, “O Venerable Svāgata, the venerable Piṇḍola­bharadvāja has explained his karmic bond.

source: །ཚེ་དང་ལྡན་པ་ལེགས་འོངས་ཚེ་དང་ལྡན་པ་བྷ་ར་དྭ་ཛ་བསོད་སྙོམས་ལེན་གྱིས་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Now you, Venerable Svāgata, should also explain your karmic bond.”

source: ཚེ་དང་ལྡན་པ་ལེགས་འོངས་ཀྱིས་ཀྱང་ད་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་ལེགས་འོངས་ཀྱིས་དེའི་ཚེ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་པར་བྱེད་དེ།
en: Then the venerable Svāgata did explain his karmic bond:

source: རྒྱལ་པོའི་ཕོ་བྲང་བཤེས་ལྡན་དུ།
en: “In the royal capital Bandhumatī,

source: །ཚོང་དཔོན་བུ་ཕོར་གྱུར་ནས་ནི།
en: I was the son of a merchant.

source: །བདག་ནི་ནོར་དང་འབྲུ་མང་ཞིང་།
en: Possessed of great wealth and much grain,

source: །སྐྱེ་བོའི་ཚོགས་ཀྱིས་བཀུར་བ་དང་། །རྒྱལ་པོ་དང་ནི་གྲོང་མི་དང་། །གསང་ཚིག་བརྗོད་པ་རྣམས་ཀྱིས་བཀུར།
en: I was honored by the people. “Respected by the king, citizens, And ministers,

source: །བལྟ་ན་སྡུག་ཅིང་མཛེས་པ་དང་། །དར་ལ་བབ་པ་གཟུགས་ཀྱིས་རྒྱགས།
en: I was pleasant to behold, attractive, And full of beauty in my youth.

source: །དེ་ནས་བདག་ནི་ཤིང་རྟར་ཞུགས།
en: “Then, in a carriage, I went to a park,

source: །སྐྱེ་བོའི་ཚོགས་ཀྱིས་མདུན་བྱས་ནས།
en: Accompanied by others,

source: །འདོད་པ་ཀུན་དང་ལྡན་གྱུར་ཅིང་།
en: Possessing every object of desire.

source: །སྐྱེད་མོས་ཚལ་དེར་དགེ་སྦྱོང་ནི།
en: Who had trained his faculties

source: །དབང་པོ་ལེགས་པར་བསྡམས་པ་དང་། །དབང་པོ་ཞི་བས་རྒྱུ་བྱེད་པ། །ཆོས་གོས་རྙིང་པ་ཅན་ཞིག་མཐོང་།
en: And behaved with his faculties pacified.

source: །དགེ་སྦྱོང་དེ་མཐོང་བདག་གིས་ནི།
en: “When I saw that śramaṇa,

source: །ཡིད་མི་བདེ་བ་སྐྱེས་གྱུར་ཏེ། །དེ་སྐྱོན་མེད་ཀྱང་མི་སྡུག་ནས།
en: I became dejected. Although he had no fault, I disliked, Reproached, and reviled him: “ ‘Whose disciple is this mendicant,

source: །སྨད་ཅིང་སྤྱོ་བ་བྱས་པ་ནི། །ཁ་དོག་ངན་ཅིང་འཇིགས་པར་སྣང་།
en: Who has an ill-colored face and dreadful appearance,

source: །མཛེ་ཅན་ལུས་ནི་ལུས་རྨ་ཅན། །ཤ་བྲི་ངན་ཅིང་རྩ་འཐོན་པ།
en: Who is leprous, with his body full of wounds, and skinny,

source: །རབ་ཏུ་བྱུང་འདི་སུ་ཡི་ཡིན།
en: His veins popping out?’

source: །ངག་གི་ཉེས་པ་སྤྱད་པ་དང་། །ལས་ཀྱི་རྣམ་པར་སྨིན་པ་དེས།
en: “Because of such verbal misconduct And the maturation of that karma,

source: །དེ་ནས་འཆི་འཕོའི་དུས་བྱས་ནས།
en: After dying there,

source: །དམྱལ་བ་རྣམས་སུ་སྐྱེས་པར་གྱུར།
en: I was born in the hells.

source: །དམྱལ་བ་ནས་ནི་ཤི་འཕོས་བདག །ཁ་དོག་ངན་ཅིང་སྡུག་བསྔལ་ལྡན།
en: “After dying in hell, I was born into suffering, with an ill-colored face.

source: །མཛེ་ཅན་ལུས་ནི་ལུས་རྨ་ཅན།
en: I was leprous, my body full of wounds,

source: །ཤ་བྲི་ངན་ཅིང་རྩ་འཐོན་གྱུར།
en: And was skinny, my veins popping out.

source: །ལག་ན་གྱོ་མོ་ཐོགས་ཤིང་རྒྱུ།
en: “I walked with a bowl in my hand,

source: །ཤ་ནའི་རས་ཀྱི་སྨད་གཡོགས་གྱོན།
en: In a hempen garment.

source: །ཕྱག་དར་ཕུང་པོའི་སྟེང་ན་ཉལ།
en: I lay on dust heaps,

source: །གནས་མེད་མགོན་མེད་སྐྱོབ་པ་མེད།
en: Homeless, helpless, without any protector.

source: །ཟས་ཀྱི་ཆེད་དུ་སྤྲང་བ་དང་། །གང་དང་གང་དུ་སོང་ན་ཡང་།
en: “When I begged for food, Wherever I went,
